# Домашнее задание к занятию «Теоретические основы криптографии»

В качестве результата пришлите ответы на вопросы в личном кабинете студента на сайте [netology.ru](https://netology.ru).

## Задача №1 Шифрование данных с использованием VeraCrypt

В данном задании необходимо познакомиться с ПО для шифрования VeraCrypt:
- Смонтируйте диск.
- Обратите внимание: какой способ шифрования и хеширования вы выбрали?
- Создайте текстовый файл с неким содержимым на смонтированном диске.
Размонтируйте диск - попробуйте получить доступ к файлу и содержимому файла.
Смонтируйте диск повторно - снова попробуйте получить доступ к файлу и его содержимому.
Сделайте выводы.
	В ответ на задание вам необходимо привести подробный отчет со скриншотами всех важных шагов, а также вывод о проделанном задании.

OpenSSL

В данном задании вам необходимо самостоятельно попрактиковаться с криптографической библиотекой OpenSSL:
Создайте текстовый файл.
Зашифруйте информацию из файла симметричным криптоалгоритмом на ваш выбор и сохраните шифр отдельным файлом.
Проверьте, получилось ли у вас зашифровать информацию.
Расшифруйте полученный шифр, сохраните расшифровку отдельным файлом.
Проверьте, получили ли вы исходное сообщение в расшифровке.
Повторите указанные шаги еще для двух симметричных алгоритмов (всего - 3 алгоритма).
	В ответ на задание вам необходимо привести подробный отчет со скриншотами всех важных шагов, а также вывод о проделанном задании.

Hashcat

Здесь вы можете ознакомиться с топом самых распространенных паролей, а также создать хеш сообщения или сгенерировать надежный пароль (во вкладках сверху): https://www.passwordrandom.com/most-popular-passwords
Ссылка на архив со словарями паролей: https://drive.google.com/file/d/1SlunnqGvFG61Edx_9rO4vIBsVEH0dNMf/view?usp=sharing

В данном задании вам необходимо восстановить пароль по хешу:
Пароль из топа распространенных - Атака по словарю 10Kmostcom.txt
Дата вашего рождения - Атака по словарю 1datas.txt
6-ти значный случайный пин-код - Полный перебор
В ответ на задание вам необходимо привести подробный отчет со скриншотами всех важных шагов, а также вывод о проделанном задании.
